run/solidificationTest/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         solidificationFoam;
startFrom           latestTime;
startTime           0;
stopAt              endTime;
endTime             10e-3; //5e-3
deltaT              .2e-5; //.2e-5
writeControl        adjustableRunTime; //adjustableRunTime; // use timeStep for debug
writeInterval       1e-6; //2e-5; // use 1 for debug
purgeWrite          0;
writeFormat         binary;
writePrecision      6;
writeCompression    off;
timeFormat          general; //fixed;
timePrecision       7;
adjustTimeStep      yes;
maxCo               0.5;
maxPhaseCo          0.02;
minDeltaT           1e-12;
//maxDeltaT           1e-6;
minSigmaW           1.0;
runTimeModifiable   yes;

// ************************************************************************* //
