run/solidificationTest/constant/alloyProperties_SS316L
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      alloyProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

components
(
    Cr
    {
        densityMelting  densityMelting  [ 1 -3 0 0 0 0 0 ]  6300;
        molarMass       molarMass       [ 1 0 0 0 -1 0 0 ]  5.2e-2;
        equilibriumS    equilibriumS    [ 0 0 0 0 0 0 0 ]   0.1746;
        equilibriumL    equilibriumL    [ 0 0 0 0 0 0 0 ]   0.17;
        slopeS          slopeS          [ 0 0 0 1 0 0 0 ]   -3182;
        slopeL          slopeL          [ 0 0 0 1 0 0 0 ]   -2828;
        diffusionS      diffusionS      [ 0 2 -1 0 0 0 0 ]  1.0e-14;
        diffusionL      diffusionL      [ 0 2 -1 0 0 0 0 ]  2.0e-9;
    }

    Ni
    {
        densityMelting  densityMelting  [ 1 -3 0 0 0 0 0 ]  7810;
        molarMass       molarMass       [ 1 0 0 0 -1 0 0 ]  5.87e-2;
        equilibriumS    equilibriumS    [ 0 0 0 0 0 0 0 ]   0.0919;
        equilibriumL    equilibriumL    [ 0 0 0 0 0 0 0 ]   0.12;
        slopeS          slopeS          [ 0 0 0 1 0 0 0 ]   -2745;
        slopeL          slopeL          [ 0 0 0 1 0 0 0 ]   -1854;
        diffusionS      diffusionS      [ 0 2 -1 0 0 0 0 ]  1.0e-14;
        diffusionL      diffusionL      [ 0 2 -1 0 0 0 0 ]  2.0e-9;
    }

    Mo
    {
        densityMelting  densityMelting  [ 1 -3 0 0 0 0 0 ]  9330;
        molarMass       molarMass       [ 1 0 0 0 -1 0 0 ]  9.6e-2;
        equilibriumS    equilibriumS    [ 0 0 0 0 0 0 0 ]   0.0287;
        equilibriumL    equilibriumL    [ 0 0 0 0 0 0 0 ]   0.025;
        slopeS          slopeS          [ 0 0 0 1 0 0 0 ]   -9333;
        slopeL          slopeL          [ 0 0 0 1 0 0 0 ]   -8235;
        diffusionS      diffusionS      [ 0 2 -1 0 0 0 0 ]  1.0e-14;
        diffusionL      diffusionL      [ 0 2 -1 0 0 0 0 ]  2.0e-9;
    }

    C
    {
        densityMelting  densityMelting  [ 1 -3 0 0 0 0 0 ]  2000;
        molarMass       molarMass       [ 1 0 0 0 -1 0 0 ]  1.2e-2;
        equilibriumS    equilibriumS    [ 0 0 0 0 0 0 0 ]   0.00008; //0.00008
        equilibriumL    equilibriumL    [ 0 0 0 0 0 0 0 ]   0.0003;
        slopeS          slopeS          [ 0 0 0 1 0 0 0 ]   -350000;
        slopeL          slopeL          [ 0 0 0 1 0 0 0 ]   -20000;
        diffusionS      diffusionS      [ 0 2 -1 0 0 0 0 ]  1.0e-14;
        diffusionL      diffusionL      [ 0 2 -1 0 0 0 0 ]  2.0e-9;
    }
);

entropyChange   entropyChange   [ 1 2 -2 -1 -1 0 0 ]    52;
interfaceEnergy interfaceEnergy [ 1 0 -2 0 0 0 0 ]      0.2;    // Nomoto2019
solidus         solidus         [ 0 0 0 1 0 0 0 ]       1699;
liquidus        liquidus        [ 0 0 0 1 0 0 0 ]       1727;

// ************************************************************************* //
