run/solidificationTest/constant/phaseFieldProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseFieldProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interfaceWidth  interfaceWidth  [ 0 1 0 0 0 0 0 ]   4e-8; //6e-8
epsilon4    0.06;
a1          0.2357;
a2          2.35;
a3          1;
a4          10;

// mapping from grain (integer) to clockwise degrees (from -45 to 45)
crystallographicAngles
{
    "-1"    10;
    "0"     45;
    "1"     -20;
}

// ************************************************************************* //
