run/solidificationTest/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 1 -1 0 0 0 0];

internalField       uniform (0 0 0);

boundaryField
{
    bottom
    {
        type        fixedValue;
        value       $internalField;
    }
    top
    {
        type        fixedValue;
        value       uniform (1e-2 0 0);
    }
    left
    {
        type        cyclic;
        neighbourPatch right;
    }
    right
    {
        type        cyclic;
        neighbourPatch left;
    }
    frontAndBack
    {
        type        empty;
    }
}

// ************************************************************************* //
