run/solidificationTest/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 2 -2 0 0 0 0];

internalField       uniform 0;

boundaryField
{
    bottom
    {
        type        fixedFluxPressure;
    }
    top
    {
        type        fixedFluxPressure;
    }
    left
    {
        type        cyclic;
        neighbourPatch right;
    }
    right
    {
        type        cyclic;
        neighbourPatch left;
    }
    frontAndBack
    {
        type        empty;
    }
}

// ************************************************************************* //
