run/solidificationTest/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-6;
        relTol          0.05;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }

    "phase.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.1;
    }
    grain
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
    }
    concentration
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0.1;
    }

}

PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    20;
    nCorrectors         1;
    nNonOrthogonalCorrectors 0;
    correctPhi          no;
    pRefCell            0;
    pRefValue           0;

    residualControl
    {
        phase
        {
            tolerance   1e-4;
            relTol      0;
        }
        concentrationMn
        {
            tolerance   1e-3;
            relTol      0;
        }
     }
}

relaxationFactors
{
    equations
    {
        ".*"   1;
    }
}

// ************************************************************************* //
